Import librairies

In [ ]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

CONNEXION DATABASE RDS

In [ ]:
#Parameters 
host="nomdatabase.etc.zone.rds.amazonaws.com"
port=
dbname="nomdatabase"
user="admin"
password="yourpasswordaws"

In [ ]:
#Connexion to Database2 RDS AWS
conn = pymysql.connect(host, user=user,port=port,passwd=password)

In [ ]:
#Creation curseur
cur = conn.cursor()

In [ ]:
#use olivdb database
cur.execute("USE database1")

0

Extraction data from tables

In [ ]:
#find the list of tables
cur.execute("SHOW TABLES")

#Fetch all the rows
tableList= cur.fetchall()

for table in tableList:
  print(table)

In [ ]:
query ="SELECT magasin.Nom,magasin.Localisation,transaction.ID_magasin,transaction.Date,transaction.ID FROM transaction INNER JOIN magasin ON magasin.ID = transaction.ID_magasin "

df_union = pd.read_sql(query, conn)

In [ ]:
df_union

             Nom    Localisation  ID_magasin       Date  ID
0   Albert Heijn           Breda           7 2020-03-22   1
1         Disney           Paris           8 2020-03-22   2
2   Village_Noel      Strasbourg           9 2020-01-03   3
3         Cagole       Marseille          10 2020-01-04   4
4       Diagonal  Maisons Alfort          11 2020-01-05   5
..           ...             ...         ...        ...  ..
83           8à8          Goyave           5 2020-03-24  84
84        Disney           Paris          15 2020-03-25  85
85  Village_Noel      Strasbourg          16 2020-03-26  86
86        Cagole       Marseille          17 2020-03-27  87
87      Diagonal  Maisons Alfort          18 2020-03-28  88

[88 rows x 5 columns]

transfert data into database2

In [ ]:
sqlEngine = create_engine('mysql+pymysql://admin:password@host.rds.amazonaws.com:port/database2', pool_recycle=3600)

dbConnection    = sqlEngine.connect()
tablename='tablename'
try:
    frame = df_union.to_sql(tablename, dbConnection, if_exists='replace');
except ValueError as vx:
    print(vx)
except Exception as ex:   
    print(ex)
else:
    print("Table %s created successfully."%tablename);   
finally:
    dbConnection.close()

Table transactionbyshop created successfully.

Closing Connection to the database RDS AWS

In [ ]:
conn.close()